/*
* ------------------------------------------------------------
* IMPORTANT: The contents of this file are auto-generated.
*
* This file may be updated by the Shopify admin theme editor
* or related systems. Please exercise caution as any changes
* made to this file may be overwritten.
* ------------------------------------------------------------
*/
{
  "sections": {
    "heading": {
      "type": "main-heading",
      "blocks": {
        "5ecb9555-19e4-433b-8817-1ccaa3a41384": {
          "type": "1",
          "settings": {
            "heading": "Frequently Asked Questions",
            "heading_size": "h3"
          }
        }
      },
      "block_order": [
        "5ecb9555-19e4-433b-8817-1ccaa3a41384"
      ],
      "settings": {
        "color_scheme": "",
        "spacing_hd": 0,
        "padding_top": 80,
        "padding_bottom": 86,
        "padding_rate": 75
      }
    },
    "accordion_inline_kQAXLA": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_iRnnpT": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I find my Order Number?",
            "content": "There are two ways to check your Order Number for your online transaction on our website.\n\nYou can check your Order Confirmation email, which was sent to you after you completed your order. The Order Confirmation number can be found in the Subject line and body of the email.<br><br>\n\n\nSign in to your account on www.thehockeyshop.com. Once you have successfully logged in, select \"Orders\" to view a breakdown of your online transactions and a list of your order history on our website."
          }
        },
        "accordion_item_HLQCBR": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I edit or cancel my order?",
            "content": "To modify or cancel your order, you can login to your account on our website and you can proceed to the Orders page to make changes to your transactions.<br><br>\n\nYou can also reach out to <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com<\/a><\/b> or call us via <b><a href=\"tel:1-800-567-7790\">1-800-567-7790.<\/a><\/b>Kindly include your order number and the reason for cancellation in your message.<br><br>\n\nKindly note that orders can only be canceled before they have been dispatched. If your order has already been shipped, please refer to our Returns in our Help Center."
          }
        },
        "accordion_item_Lc4iUk": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I track my order?",
            "content": "Once your order has been placed and processed, you will receive a confirmation email instantly with your order details. You can track your order by logging in to your account or from your order confirmation email. <br><br>\n\nTracking and delivery information may not be immediately available after your order is placed. Just a heads up that it can take up to 24 hours before you receive an email notification that your order has been shipped with tracking details. No need to worry though, we'll keep you updated every step of the way!"
          }
        },
        "accordion_item_4mPMDA": {
          "type": "accordion_item",
          "settings": {
            "title": "How does Sezzle work?",
            "content": "Buy now, pay later. Split your entire online purchase into 4 interest-free payments, over 6 weeks with no impact to your credit. For more information, visit our How Sezzle Works page."
          }
        },
        "accordion_item_rtPjRm": {
          "type": "accordion_item",
          "settings": {
            "title": "What payment options are available?",
            "content": "We accept VISA, Mastercard, AMEX, PayPal, and Sezzle. Looking to pay in installments? Check out how sezzle works here. If you need to use multiple cards for a purchase we recommend purchasing an e-gift card and then applying that credit toward the purchase."
          }
        },
        "accordion_item_tHkn3a": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I pick up my order?",
            "content": "For Order pickups for website or online purchases made through: www.thehockeyshop.com, you can select the Pickup in store option during the checkout process.<br><br>\nOnce your order has been placed and processed for pickup,  you will receive a confirmation email plus another email that Your Order is Ready for Pickup. Kindly keep your confirmation email and Order number ready upon your arrival to our store.<br><br>\nPickup location:<br>\n\nThe Hockey Shop | 20202 66 Ave Langley, BC V2Y 1P3<br>\n\n\n(Look for our Order Pickup Counter beside checkout)"
          }
        },
        "accordion_item_Qy4Erg": {
          "type": "accordion_item",
          "settings": {
            "title": "Some items are missing from my order",
            "content": "We're sorry to hear this. If there are missing items items from your order, kindly reach out to us through this link: Report Issue or call us through <a href=\"tel:604-589-8299\">604-589-8299<\/a>."
          }
        },
        "accordion_item_6HydPc": {
          "type": "accordion_item",
          "settings": {
            "title": "The items are different\/wrong from what I ordered",
            "content": "We're sorry to hear this. Please let us know exactly what iterm\/color\/size you actually received, and reach out to us through this link: Report Issue or call us through <a href=\"tel:604-589-8299\">604-589-8299<\/a>."
          }
        }
      },
      "block_order": [
        "accordion_item_iRnnpT",
        "accordion_item_HLQCBR",
        "accordion_item_Lc4iUk",
        "accordion_item_4mPMDA",
        "accordion_item_rtPjRm",
        "accordion_item_tHkn3a",
        "accordion_item_Qy4Erg",
        "accordion_item_6HydPc"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Orders",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 16,
        "padding_bottom": 19,
        "padding_rate": 75
      }
    },
    "accordion_inline_ykVmyj": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_hYYCay": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I return\/exchange an item?",
            "content": "Eligible items can be returned or exchanged using the returns portal here: <b>Returns Portal<\/b>.<br><br>\nWe have tried to make our in-store and website return policy as easy as possible. If you are unsatisfied with your purchase in any way, you can return unused items in new condition within 90 days for a full refund, no questions asked. The refund will be processed using the same method that the original purchase was made.<br><br>\n\n<b>Return Online<\/b><br><br>\nYou can proceed to our <b>Returns Portal<\/b>. For further assistance you can also reach out to our customer support team at <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com<\/a><\/b> or call us via <b><a href=\"tel:1-800-567-7790\">1-800-567-7790.<\/a><\/b> to start the return process with your order number and details about the item you wish to return. <br><br>\n\n<b>Return In-Store<\/b><br><br>\nYou can visit our retail location in Langley, BC and present your order confirmation or packing slip as proof of purchase. <br><br>\n\n<b>Unretrunable Items<\/b><br><br>\nThe following items are not eligible for returns or exchanges:<br><br>\n\nJocks & Jills <br>\nBaselayer Bottoms<br>\nBoxers & Briefs<br>\nMouth Guards<br>\nUsed Products<br>\nPPE\/Fabric Face Masks"
          }
        },
        "accordion_item_AjYU9Q": {
          "type": "accordion_item",
          "settings": {
            "title": "How long do I have to return an item?",
            "content": "You have up to 90 days to return an item after the date of purchase. We have tried to make our in-store and website return policy as easy as possible. If you are unsatisfied with your purchase in any way, you can return unused items in new condition within 90 days for a full refund, no questions asked. The refund will be processed using the same method that the original purchase was made.<br><br>\n\n<b>Return Online<\/b><br><br>\nYou can proceed to our <b>Returns Portal<\/b>. For further assistance you can also reach out to our customer support team at <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com<\/a><\/b> or call us via <b><a href=\"tel:1-800-567-7790\">1-800-567-7790.<\/a><\/b> to start the return process with your order number and details about the item you wish to return. <br><br>\n\n<b>Return In-Store<\/b><br><br>\nYou can visit our retail location in Langley, BC and present your order confirmation or packing slip as proof of purchase. <br><br>\n\n<b>Unretrunable Items<\/b><br><br>\nThe following items are not eligible for returns or exchanges:<br><br>\n\nJocks & Jills <br>\nBaselayer Bottoms<br>\nBoxers & Briefs<br>\nMouth Guards<br>\nUsed Products<br>\nPPE\/Fabric Face Masks"
          }
        },
        "accordion_item_ddVeFN": {
          "type": "accordion_item",
          "settings": {
            "title": "Which items are eligible for return?",
            "content": "<b>Unretrunable Items<\/b><br><br>\nThe following items are not eligible for returns or exchanges:<br><br>\n\nJocks & Jills <br>\nBaselayer Bottoms<br>\nBoxers & Briefs<br>\nMouth Guards<br>\nUsed Products<br>\nPPE\/Fabric Face Masks"
          }
        }
      },
      "block_order": [
        "accordion_item_hYYCay",
        "accordion_item_AjYU9Q",
        "accordion_item_ddVeFN"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Returns",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "scheme-1",
        "padding_top": 25,
        "padding_bottom": 25,
        "padding_rate": 75
      }
    },
    "accordion_inline_ijmy7e": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_jKtQnJ": {
          "type": "accordion_item",
          "settings": {
            "title": "How can I get free shipping?",
            "content": "We are pleased to offer free delivery for orders over $100 shipped to most locations within Canada and the United States. However, please note that there are a few postal codes which may not be eligible for free shipping. In cases of oversized packages, a flat rate fee of $9.99 will be applied. You will be automatically eligible for free shipping once your subtotal reaches $100 and this option will be shown at checkout. Kindly note that all orders eligible for free shipping will be shipped via ground service.<br><br>"
          }
        },
        "accordion_item_nWPkrx": {
          "type": "accordion_item",
          "settings": {
            "title": "Can I pick up my order in-store?",
            "content": "Absolutely! We offer free in-store pickup at checkout, and you will receive instructions via email. Orders are typically available within a few hours during store business hours.  <br><br>\n\n\nMonday to Wednesday |\t10am - 6pm<br>\nThursday to Friday |\t10am - 8pm<br>\nSaturday\t  9am - 6pm\nSunday\t10am - 5pm"
          }
        },
        "accordion_item_c4CmUc": {
          "type": "accordion_item",
          "settings": {
            "title": "How long will shipping take?",
            "content": "Our goal is to ensure that all orders are shipped out the same day or the following day, wherever possible. The estimated transit times for ground shipping are as follows:<br><br>\n\nWestern Canada: 1-4 business days<br>\nEastern Canada: 4-6 business days<br>\nUSA: 3-8 business days<br>\nInternational: 5-10 business days<br><br>\nPlease note that these are just estimates and not guarantees. The actual transit times may vary depending on the package dimensions and the final destination. If you have selected express shipping, the transit time will be shown at checkout and typically takes 1-3 days to deliver.<br><br>\n\nHowever, please note that sticks require additional handling and may arrive a day later than another package if the order is a multi-piece shipment.<br><br>\n\nFor additional questions about our shipping policy, please contact us at <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com<\/a><\/b> or call us via <b><a href=\"tel:1-800-567-7790\">1-800-567-7790.<\/a><\/b>"
          }
        },
        "accordion_item_tcEFQY": {
          "type": "accordion_item",
          "settings": {
            "title": "Can I order from outside of Canada?",
            "content": "Certainly! We offer a variety of products that can be shipped to the US and other countries. To view our international selection, please click on <b>International Store.<\/b> However, some of our products are only available for shipping to Canadian addresses. To identify these items, please look for the <b><i>\"Ships Canada Only\"<\/i><\/b> icon on the product page. This icon indicates that the manufacturer has imposed shipping limitations on the product.<br><br>\n\nFor instance, Bauer products cannot be shipped outside of Canada, and CCM, True, and Warrior products also have their own shipping restrictions in place."
          }
        },
        "accordion_item_pRgLPn": {
          "type": "accordion_item",
          "settings": {
            "title": "How can I ensure my that my package is protected?",
            "content": "Safeguard your package for just $1.99 with premium shipping protection during checkout. <br><br>\nWe will quickly replace and resend your order if it gets lost or damaged. <br><br>\n\nIf your order is marked as delivered but there's no sign of the package, wait at least 1 business day before hitting the panic button. Unfortunately, it is common for couriers to mark an item as delivered well before the delivery attempt is made. After waiting a day, reach out to our team at sales@thehockeyshop.com to resolve the issue. <br><br>\n\nPackages that are unprotected will follow the standard claims policy of the shipping courier which can take additional time and the final decision is up to the discretion of the courier."
          }
        },
        "accordion_item_VnUDx7": {
          "type": "accordion_item",
          "settings": {
            "title": "How do you ship hockey sticks?",
            "content": "Great question! We have custom boxes designed for that! The box works as a large envelope or sleeve and will secure the stick and protect it in transit. We can ship up to 4 sticks per box."
          }
        }
      },
      "block_order": [
        "accordion_item_jKtQnJ",
        "accordion_item_nWPkrx",
        "accordion_item_c4CmUc",
        "accordion_item_tcEFQY",
        "accordion_item_pRgLPn",
        "accordion_item_VnUDx7"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Shipping",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 85,
        "padding_bottom": 70,
        "padding_rate": 75
      }
    },
    "accordion_inline_QHXtfF": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_LMyYJC": {
          "type": "accordion_item",
          "settings": {
            "title": "What happens if the price drops?",
            "content": "If you find the item you purchased advertised at a lower price within 30 days of purchase, we will refund you the difference. \n<br><br>\nSimilarly, if we adjust the selling price below the original invoiced price within 30 days of purchase, we will refund you the difference.  \n<br><br>\nPlease be aware that refunds will be processed using the same method as the original purchase. Unfortunately, we cannot accept credit card information over the phone or email for refunds. In such cases, we would be happy to provide a store credit refund instead."
          }
        },
        "accordion_item_LPKNpp": {
          "type": "accordion_item",
          "settings": {
            "title": "Do discounts apply to all items?",
            "content": "Discount codes can be used on all regular priced non-MAP items. It cannot be combined with other promotions or applied to sale priced items."
          }
        },
        "accordion_item_yAbtLj": {
          "type": "accordion_item",
          "settings": {
            "title": "How does price matching work?",
            "content": "We strive to offer competitive prices, but in case you come across a lower advertised price for an identical and in-stock item from any of our competitors, we would be happy to match that price. If you are unsure about the price comparison, please reach out to our customer service team, and we will look into it for you.  <br><br>\n\nPlease note that if you find the item available at a lower price on an international website, the price will need to be converted into CAD before the price adjustment is calculated. <br><br>\n\nFurthermore, if you find the item you purchased advertised at a lower price within 30 days of purchase, we will refund you the difference. <br><br>\n\nSimilarly, if we adjust the selling price below the original invoiced price within 30 days of purchase, we will refund you the difference.  \n<br><br>\nPlease be aware that refunds will be processed using the same method as the original purchase. Unfortunately, we cannot accept credit card information over the phone or email for refunds. In such cases, we would be happy to provide a store credit refund instead."
          }
        },
        "accordion_item_rYiWBi": {
          "type": "accordion_item",
          "settings": {
            "title": "What does MAP mean?",
            "content": "MAP stands for Minimum Advertised Price. Items tagged as MAP are excluded from any online discounts, coupons and promotions. These MAP policies are put in place by brands and typically apply to elite level products at the start of the product cycle."
          }
        }
      },
      "block_order": [
        "accordion_item_LMyYJC",
        "accordion_item_LPKNpp",
        "accordion_item_yAbtLj",
        "accordion_item_rYiWBi"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Price Policy",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 85,
        "padding_bottom": 70,
        "padding_rate": 75
      }
    },
    "accordion_inline_YtbiaV": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_3cPfTU": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I process a warranty claim?",
            "content": "If you're here because an item is faulty or defective...sorry to hear! We'll work to get that item replaced for you. Our store carries many brands that offer extensive warranties for premature breakage, which means you could receive a replacement product. If you're located in Surrey, BC, our retail location is ready to assist you. However, if you're shopping from out of town, you can submit a warranty claim digitally using photos of the item. You can find information for each brand on our website under Warranty Information. This page outlines all warranty timelines, policies, and procedures."
          }
        },
        "accordion_item_VyQCQz": {
          "type": "accordion_item",
          "settings": {
            "title": "Which items have a warranty?",
            "content": "Nearly all the hockey and goalie products we sell are covered by a manufacturer's warranty. For a full list of products covered by warranty, visit our Warranty Information page. Pro stock equipment is not covered under warranty as these items have been built specifically for professional players."
          }
        },
        "accordion_item_aK9bhU": {
          "type": "accordion_item",
          "settings": {
            "title": "When does the warranty period begin?",
            "content": "All warranties begin from the original purchase date, not the date of arrival. You can find information for each brand on our website under Warranty Information. This page outlines all warranty timelines, policies and procedures."
          }
        },
        "accordion_item_GKgyPj": {
          "type": "accordion_item",
          "settings": {
            "title": "How long is the warranty period?",
            "content": "In general, hockey and goalie sticks are covered by a 30 day warranty. Protective goods typically have a 90 day warranty. Helmets and masks are often covered up to 1 year. For full details offered by each brand, kindly visit our Warranty Information page."
          }
        }
      },
      "block_order": [
        "accordion_item_3cPfTU",
        "accordion_item_VyQCQz",
        "accordion_item_aK9bhU",
        "accordion_item_GKgyPj"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Warranty",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 85,
        "padding_bottom": 70,
        "padding_rate": 75
      }
    },
    "accordion_inline_zKGeqc": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_JRziEF": {
          "type": "accordion_item",
          "settings": {
            "title": "Can you fix my hockey gear and skates?",
            "content": "We have an expert on-site who can help you with fixing your equipment. We won’t be happy until you are with your gear, and we will make sure to work on your gear efficiently and with great detail.<br><br>\nRepairs Available at the Hockey Shop include:<br><br>\n\nPlayer Glove Sewing<br>\nLeg Pad Binding Repairs<br>\nRe-lacing Catcher Pockets<br>\nMounting\/Riveting Holders<br><br>\n\nIn case you do not find the repair service you need on our list, please feel free to reach out to us via phone or email. Our team will do their best to identify and solve your problem, and work on your gear accordingly.<br><br>\n\nIf, for any reason, your hockey equipment cannot be repaired, our team of experts can assist you in finding new gear. We have extensive knowledge in this field and can help you choose the perfect gear that matches your preferences and style."
          }
        },
        "accordion_item_Cc6HrL": {
          "type": "accordion_item",
          "settings": {
            "title": "Can you sharpen my hockey skates?",
            "content": "We also cater to Skate Sharpening needs.<br><br>\n\n\n\nPlease see the following sharpening options we offer:<br><br>\n\nBlademaster – Traditional Hollow, or ROH<br>\nBlademaster – Flat Bottom Hollow (Blade Form Dressing, or BFD)<br>\nBlackstone – Flat Bottom V (FBV)<br>\nPro-Sharp – Z-Channel<br>\nSparx – Traditional Hollow, or ROH<br><br>\nFor a more in-depth explanation about different sharpening styles, or if you need help figuring out which one is best for you, feel free to come in or contact The Hockey Shop for further assistance."
          }
        },
        "accordion_item_pqgjDK": {
          "type": "accordion_item",
          "settings": {
            "title": "What is Skate Profiling?",
            "content": "It's possible to skate and play well with the manufacturer's profile. However, the issue is that those profiles are not customized to fit you. Profiling considers various aspects of your play and you, including your height and weight, sharpening style (hollow), player position and skill level, ice hardness, previous profile, skate brand\/family\/holder size, foot position, leg shape, arm length, goals for improving your skating, and current balance and base position, maneuverability, speed, and style (goalies). <br><br>\n\nThe Hockey shop offer different options of Skate Profiling:<br><br>\n\nSingle Radius<br>\nDouble Radius<br>\nTriple Radius<br>\nQuad Radius<br>\nEllipse <br><br>\nWe understand that profiling can be complex, so we have expert staff on-site to help answer any questions and assess your playing style."
          }
        },
        "accordion_item_MCJEKP": {
          "type": "accordion_item",
          "settings": {
            "title": "I want to know more about Custom Skate Fitting",
            "content": "The Hockey Shop is one of a few stores in North America that offers a Custom Skates Fitting from leading brands:<br><br>\n\nMyBauer Fit Station and Program<br>\nCCM Total Custom and Total Custom Plus <br>\nTRUE Fit Centre<br><br>\n If you are looking to get custom skates that are designed to fit you perfectly, we can assist you. However, understanding all the technical details and getting the measurements right can be quite challenging. To make things easier, you can contact The Hockey Shop by sending an email to sales@thehockeyshop.com or by calling <a href=\"tel:604-589-8299\">604-589-8299 <\/a>to book a skate fitting appointment."
          }
        },
        "accordion_item_tD9Mpc": {
          "type": "accordion_item",
          "settings": {
            "title": "Do you customize jerseys?",
            "content": "The Hockey Shop provides custom NHL jerseys for those who want to add a little more flair to their cheering.<br> Our professional Team Sales department is dedicated to creating custom gear for teams, and we assure you that the same level of quality and attention to detail will be applied to your custom NHL jersey.<br><br> Our team takes care of customization options such as names and numbers. If you want a custom jersey made, contact our Team Sales via call <a href=\"tel:1-800-567-7790\">1-800-567-7790<\/a> or email <a href=\"mailto:teamsales@thehockeyshop.com\">teamsales@thehockeyshop.com<\/a> to start your custom order."
          }
        }
      },
      "block_order": [
        "accordion_item_JRziEF",
        "accordion_item_Cc6HrL",
        "accordion_item_pqgjDK",
        "accordion_item_MCJEKP",
        "accordion_item_tD9Mpc"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Store Services",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 85,
        "padding_bottom": 70,
        "padding_rate": 75
      }
    },
    "accordion_inline_bqQ4Ha": {
      "type": "accordion_inline",
      "blocks": {
        "accordion_item_YjEWMN": {
          "type": "accordion_item",
          "settings": {
            "title": "How do I find the right size and fit?",
            "content": "Kindly refer to the the \"Size Guide\" button on each product page. We use a combination of supplier sizing information with our experience to help determine the best fit for you. <br><br>\n\nYou can also refer to other articles for specific guidelines for:<br><br>\n\n<b><a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s1\">Player Glove Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s2\">Player Shin Guard Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s3\">Player Shoulder Pad Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s4\">Player Pant Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s14\">Player Skate Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s12\">Player Elbow Pad Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s13\">Hockey Player Stick Sizing & Information Guide<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s5\">Goalie Leg Pad Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s6\">Goalie Catch Gloves Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s7\">Goalie Blockers Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s8\">Goalie Chest Protector Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s9\">Goalie Pants Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s10\">Goalie Mask Sizing<\/a><br>\n\n<a href=\"https:\/\/www.thehockeyshop.com\/pages\/help-with-sizing#s11\">Goalie Stick Sizing<\/a><br><br>\n<\/b>\n\nFor further questions regarding size, give our experts a call at <b><a href=\"tel:1-800-567-7790\">1-800-567-7790<\/a><\/b> or send us an email at <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com<\/a><\/b>."
          }
        },
        "accordion_item_TKrcCC": {
          "type": "accordion_item",
          "settings": {
            "title": "Do you sell Gift Cards?",
            "content": "We have 2 types of Gift Cards available:<br><br>\n\n- <b>E-Gift Card<\/b>: are only issued in a digital format. From the confirmation email, you can choose to print and physically give to your recipient.<br>\n- <b>Physical Gift Cards<\/b>:  can be purchased separately at any Source For Sports location but can only be used for in-store purchases and not online at <b><a href=\"thehockeyshop.com\">thehockeyshop.com<\/a><\/b><br><br>\nBOTH come in different denominations you can select when you purchase.<br><br>\n\n\n\n<b>How to purchase E-Gift Cards<\/b><br><br>\n\n<b><u><a href=\"https:\/\/www.thehockeyshop.com\/products\/the-hockey-shop-online-gift-card\">E-Gift Cards<\/a><\/u><\/b> can be purchased at thehockeyshop.com.<br><br>\n\nSelect the amount of the e-gift cards you would like to purchase and \"Add to Bag.\"<br><br>\n\nProceed to checkout and make the purchase<br><br>\n\nYou will receive an email with your e-gift card details. You can view the e-gift card, forward it to your recipient or schedule the e-gift card to be delivered on a specific date and time to your recipient via email.<br><br>\n\nYou can view or change your scheduling options by clicking the \"Schedule e-Gift Card\" button in your confirmation email. <br><br>\n\n\n\n<b>Important Information for E-Gift Cards<\/b><br>\n\nOur e-gift cards are only redeemable online at thehockeyshop.com or at The Hockey Shop Source for Sports retail location in Langley, BC. It cannot be redeemed at any other Source for Sports location.<br><br>\n\nE-gift cards are non-refundable and cannot be redeemed for cash.<br><br>\n\nPhysical gift cards can be purchased separately at any Source For Sports location but can only be used for in-store purchases and not online at thehockeyshop.com<br><br>\n\nE-gift cards are only issued in a digital format. From the confirmation email, you can choose to print and physically give to your recipient.<br><br>\n\nFor any inquiries on E-Gift Cards, you can also email <b><a href=\"mailto:sales@thehockeyshop.com\">sales@thehockeyshop.com.<\/a><\/b>"
          }
        },
        "accordion_item_wtK4ei": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for Player Glove",
            "content": "When fitting a hockey glove, it is important to first decide on the style of glove that you prefer. This is entirely a personal choice and is usually influenced by what you have worn in the past. A tighter-fitting glove will have less negative space and will feel like a second skin, providing a better feel on the fingers and palm. However, you may notice a reduced amount of mobility around the wrist. On the other hand, a looser or more traditional fit glove will feel more spacious and fit wider in all areas.<br><br>\n\n\n\n\n\nIt's also important to consider the gap between the cuff of the glove and the user's elbow pad. You should try to minimize this gap as much as possible. If the player prefers a glove with a shorter cuff, you may want to consider using an item such as a slash or wrist guard to protect the area in between.<br><br>\n\n<b>Things To Consider:<\/b><br>\nAge<br>\nLevel of Play<br>\nDesired Fit (Loose or Tight)<br><br>\n\n<b>Fitting For Growth Room:<\/b><br>\n When fitting a growing player with a glove, it's important to leave some room for growth, but not too much that it affects their performance. To check if the glove is too big, ask the player to put their hand inside it as if they were playing. Use your index finger to measure the extra space between the top of the palm and the cuff's edge. The space should be no more than the width of your index finger. Then, ask the player to press their fingers against the palm, ensuring their pinky finger is at least 3\/4\" into the pinky slot. To check if the glove fits well, pick up the stick by the shaft. If it's challenging to do so, the glove is likely too big.<br><br>\n\n\n\n\n\nTo check if the glove is too small, ask the player to put their hand inside it as if they were playing. Feel along the inner cuff above the palm material to check if their palm is spilling over the cuff. Ask the player to press their fingers against the palm to see if their fingers fit in each finger slot without touching the edges.<br><br>\n\n\n<b>Fitting For True Size:<\/b><br>\n\n It's important to keep in mind that when choosing the right size of a glove, it should fit snugly as itwill stretch and compress over time. To determine the correct size, put the glove on your hand and ensure that your fingers fit comfortably into the finger slots without pushing into the gussets. Your palm should also fit comfortably without spilling over the end of the palm material and onto the inner cuff.<br><br>\n\n\n\nDifferent gloves and brands will position the thumb slightly differently, so it's recommended to try on a few until you find a comfortable pair. There are also different types of palms available, such as a regular \"Nash\" leather palm or a more durable all-leather pro palm. Some gloves even have high-density foams and plastic inserts for added protection.<br><br>\n\nIt's important to select a glove with a protection level that matches your playing style. We recommend getting the highest level of protection that you can afford. To find your best fit, compare your height, weight, and age to the charts provided, and measure (in inches) from the tip of your middle finger(or which finger is longest) and measure all the way down to the bottom of your palm. Record this measurement and multiply by two. This will be roughly the size of glove you need.  This measurement will determine the recommended glove size (e.g., if you measure 14.5\", you will want a 15\" glove)."
          }
        },
        "accordion_item_mXhA8R": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for a Player Shin Guard",
            "content": "<b>Important Things To Consider:<\/b><br>\nAge, Height and Weight<br>\nLevel of Play<br>\nDistance Between the Middle of the Kneecap and top of your Skate<br><br>\nWhen choosing a shin pad, the first thing to consider is whether you will wear it over the skate tongue or if the tongue will be in front of the pad. This determines the length you need. <br><br>\n\nYour knee should fit in the center of the kneecap, which is usually padded for comfort and guidance. Once the pad is strapped on, it should be snug and secure, without twisting or rotating. There are many strapping options available, so you need to decide what you like best. Some models come with anchor straps or thicker straps that provide a more secure fit. Anchor straps are stretchy and are fastened above or below the calf muscle to keep the pad in place. Thicker straps across the calf wrap\/guard provide full protection and ensure that the calf guard reaches across your leg.<br><br>\n\n\n\nRemember, as the price increases, you typically get more adjustments, options, and higher density foams and technologies. So, choose a shin pad that fits your budget and offers the features and comfort you require.<br><br>\n\n\n<b>Sizing A Shin Pad Over Top Of Your Skate Tongue:<\/b><br>\n\n\nTo properly size a shin pad when fitting it over the top of your skate tongue, measure the length of your leg (in inches) from the middle of your knee cap, when it is bent at a 90 degree angle, to the top of the boot of the skate. Once you have this measurement, round the number up to the next whole number (for example, 13.2” becomes 14”). Since the shin pad is sitting over the skate tongue, it allows you to wear a slightly larger pad without compromising your mobility. This is usually seen as an advantage because it provides extra protection to areas like the tongue of your skate. If you are sizing a player and want to allow for growth room, we recommend this method as well, as it permits the use of a larger pad while still maintaining motion and mobility.\n<br><br>\n\n\n<b>Sizing A Shin Pad Underneath Your Skate Tongue:<\/b><br>\n\n\nTo size a shin pad correctly when fitting under the top of your skate tongue, measure the length (in inches) of your leg from the middle of your knee cap, when it is bent at a 90 degree angle, to the top of the boot of the skate. Once you have this measurement, round the number down to the next whole number (i.e. 13.5” becomes 13”). Because the shin pad is shipping underneath the skate tongue, the pad will not be able to sit right against the edge of the skate and thus a slightly shorter shin pad is used. If a shin pad that is too big is tried on, you will notice that the shin pad is shifted up and the kneecap falls out of the designated spot. If this happens your shin and knee will not be properly protected and you are more susceptible to having your shin pad rotate or more as well.\n<br><br>\nCompare your height, weight and age to the charts provided to find your best fit. As well, use the measurement that was taken above to compare to the provided charts. Another good estimation is to look at your old\/existing shin pads to see what size they are. If you are growing and have outgrown them, then next size up is probably for you. If you liked the way your shin pads felt, it may be smart to continue with the same size."
          }
        },
        "accordion_item_AfiBXe": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for a Player Shoulder Pads",
            "content": "<b>Important Things To Consider:<\/b><br>\nAge, Height and Weight<br>\nChest Size<br>\nLevel of Play<br><br>\nWhen it comes to fitting Shoulder Pads, personal preference is key, but it's important to ensure they are comfortable and not restrictive. For higher levels of play, you'll need a more protective pad, but keep in mind that more protection doesn't always mean bulkier. Look for designs that offer great mobility while still providing adequate protection.<br><br>\n\nIt's crucial to ensure your shoulders fit directly underneath the shoulder caps of the pad to ensure your clavicles, shoulders, biceps, and upper arms are protected. Most shoulder pads come with built-in adjustments, which will vary in their level of adjustability. Bicep pads are the most commonly adjustable, as they can be raised or lowered to avoid interfering with elbow pads. This is also useful when sizing for kids, as you can lower the bicep guard as they grow taller.\n\n\n<br><br>\nTo measure your chest size, measure the circumference just below your armpits. Each shoulder pad will have a matching size or range of sizes within the charts to guide you. Most shoulder pads are offered in Small, Medium, Large, and Extra Large online, and sizing charts are provided to help you double-check where you line up and to list all the available sizes. Keep in mind that personal preference is also a factor when looking for the best fit."
          }
        },
        "accordion_item_9JU7XA": {
          "type": "accordion_item",
          "settings": {
            "title": "How to properly fit a Hockey Helmet",
            "content": "Hockey helmets typically come in basic sizes such as Small, Medium, and Large. To find the right size, measure the <b>circumference of your head<\/b> about ½”-1” above your eyebrows using a soft tape measure. This measurement in inches or centimeters generally corresponds to your helmet size. <br><br>\n\n\n\n<b>How to properly fit a Hockey Helmet?<\/b><br>\n1. Begin by adjusting it to the largest setting. <br>\n2. Next, put the helmet on and gradually tighten it until it fits snugly but remains comfortable. It should sit flat on the head with the rim approximately ½” above the eyebrows, without tilting forward or backward. <br>\n3. Ensure that the chin strap is fastened securely under the chin. The helmet should fit tightly enough to prevent shifting, but not so tight as to be uncomfortable.<br><br>\n\n\n\n\nIf you experience any pressure or pinching, the helmet is too small. For parents and young players, keep in mind that helmets can accommodate some room for growth and can be readjusted over time. It's generally not recommended to purchase a larger size for kids to \"grow into,\" but it is possible to buy a hockey helmet that can be adjusted to a larger size as the child grows."
          }
        },
        "accordion_item_GdXTq6": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for Skates",
            "content": "It's crucial for hockey players of all ages to have well-fitting skates. If the skates are the wrong size or uncomfortable, the player could get blisters, damage the boots, or even start to dislike playing. To prevent these issues, it's important to learn how to properly fit ice hockey skates.<br><br>\n\nIf you’ve never shopped for a pair before, you might start out wondering, \"What size ice skates should I buy?\" As a general rule, you want to get a skate that is 1 to 1½ sizes smaller than your shoe size. Some sizing specifics depend on the brand— sizing charts are provided in each of our product pages to help you determine the correct size for you.<br><br>\n\nFitting for a player who is still growing, make sure you can fit one finger between the inside of the boot and the heel of the foot. This gives room for growth over time.  Adult skates mold to the foot, so extra space is not needed.<br><br>\n\nFor professional fitting of hockey skates, our Player Skating team can also assist you in determining the correct size for you.<br><br>\n\n\n\n\n<h5>BAKING YOUR SKATES<\/h5><br>\nBaking your skates is a process in which the skates are placed in a special skate oven to achieve a better fit. This process helps to mold the stiff sides and upper part of the boot to conform to the shape of the player's foot, ensuring a proper hockey skate fit. Not all skates can be heat-molded, especially beginner skates as they aren't made with materials that withstand the process well. For players in heat-moldable intermediate or elite skates, though, baking shortens the break-in time by about half.<br><br>\n\nA poorly fitting skate can create bad habits and break down prematurely, hindering skate performance. Blisters or heel spurs can also occur. To break in your new skates, spend some time wearing them at home. You could use a hair dryer to warm them up, but be careful not to overheat any one area. Let them completely cool before walking in them. <br><br>\n\nThe more time you spend wearing your new skates while laced up, the faster the break-in period will be. Your feet will feel better when you hit the ice for the first skate with them. Remember to wear rubber skate guards to avoid damaging floors. \n<br><br>\nAll skates purchased from <b><a href=\"mailto:thehockeyshop.com\">thehockeyshop.com<\/a><\/b> come with free sharpening. Be sure to specify what hollow you would like your skates sharpened at."
          }
        },
        "accordion_item_yAN3DW": {
          "type": "accordion_item",
          "settings": {
            "title": "How to take care of your Skates",
            "content": "1. Remember to dry your skates out after every use to help prolong their life and prevent odors. <br> <br> \n2. Pull out the footbed each time you dry them to prevent excessive rusting of the rivets.<br> <br> \n\n3. Regularly check the blades for nicks caused by dirty flooring, concrete, or screws in the rink. <br> <br> \n\n4. If you feel like you're slipping during push-off, it's time for a sharpening. Keep in mind that having properly sharpened skates is crucial, and the best depth of hollow is a personal preference. Remember that a sharper blade does not necessarily mean quicker; less hollow means more glide."
          }
        },
        "accordion_item_Ux3LbL": {
          "type": "accordion_item",
          "settings": {
            "title": "Choosing the right roller skate",
            "content": "There are three categories for Roller Skates: <b>Recreational, Performance, and Elite.<\/b> It’s crucial to select the appropriate skill level to enhance your performance on the floor.<br><br>\n\n<b>Recreational skates<\/b> are often used as starter skates for youth, beginners, and casual skaters. It's important to consider the size and weight of the skater. While recreational skates are designed for beginners, heavier adult skaters can exert more force than the skates were intended to handle, leading to premature breakdown. In such situations, we recommend choosing performance-level skates, as they will last longer over time.\n<br><br>\n\n\n<b>Performance skates<\/b> are for those skaters who wish to take their performance to the next level. As you become more experienced and confident on skates, you'll want to upgrade to performance-focused skates with sturdier boots, bearings, and inline wheels. \n\n<br><br>\n\n\n<b>Elite skates<\/b> come with rigid boots and high-quality materials for the chassis, wheels, and bearings, which enhance your skating performance not to mention lighter than performance skates."
          }
        },
        "accordion_item_fbCrxf": {
          "type": "accordion_item",
          "settings": {
            "title": "What are roller skates made of?",
            "content": "All inline skates have three parts: the boot (quarter package), the chassis, and the wheels. Starter skates & recreational skates will both have softer boots for more comfort, and an entry level chassis. More advanced inline skates feature composite materials creating stiffer boots, for added performance and durability features. They are also equipped with higher end chassis as well as better liners providing comfort.<br><br>\n\n \n\n<b>Skate Boot (Quarter Package):<\/b><br> The boot of the skates is where your foot sits. Boot comes with single or dual-layered liners for more protection, stiffness and durability.<br><br>\n\n\n\n<b>Chassis:<\/b><br> The chassis plays a similar role to that of an ice hockey holder as it attaches to the skate and holds the wheels. Chassis are typically lightweight, made from durable aluminum & steel. The higher the model, the lighter and more durable the chassis.<br><br>\n\n\n\n<b>Wheels:<\/b><br> Inline wheels are perhaps the most critical component of roller hockey skates as they affect overall performance. Wheels come in different sizing depending on the chassis set up. They also come in different hardness levels to cater to the skaters’ individual needs based on desired speed, power, and grip. Most inline wheels are constructed using polyurethane, however come in different densities offering durability, and performance based on the playing surface. The hardness level required is also based off the surface that the player is playing on."
          }
        },
        "accordion_item_JE48zz": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for a Player Pant",
            "content": "When choosing player pant, the waist should fit comfortably and snugly. Most pants come with a belt and suspender buttons, but suspenders are optional. They're helpful if you're still growing as they allow for extra length. Some pants come in \"Long\" or \"Tall\" versions, offering an inch of extra length.<br><br>\n\n<b>Things To Consider:<\/b> <br>\n\nAge, Height and Weight<br>\nWaist Size<br>\nLevel of Play<br><br>\n\n<b>Fitting For Growth Room:<\/b><br>\nTo ensure that a pant has growth room, make sure it fits snugly around the waist, and the belt sits just above the hip bones. The pant should come down as far as possible, but avoid making it too big as it may interfere with shin pads and restrict movement. As a general rule, a pant with growth room should align with the bottom of the knee cap when standing straight and fastened at the waist. When you bend your knees and assume a 'hockey stance,' the pant should slide up the knee and end up around the middle of the kneecap. The pant is too small if it does not reach the top of the knee cap when standing straight.\n<br><br>\n\n\n\n\n<b>Fitting For True Size:<\/b><br>\nWhen selecting the right size of pant, it's essential to ensure that it fits snugly around your waist, with the belt sitting just above your hip bones. The pant should be long enough to protect your thighs, but not so long that they interfere with your shin pads. A good rule of thumb is to choose pant that fit between the middle and top of your kneecap when standing straight. As you move into a hockey stance and bend your knees, the pant should slide up to fall in line with the top of your shin pads.\n\n<br><br>\n\n\nWhen shopping online, you'll usually find pants offered in Small, Medium, Large, and Extra Large sizes. Each product will have a sizing chart to help you determine where you fit and list all available sizes. These charts are for reference purposes only, and personal preference also plays a role in finding the perfect fit. The level of protection offered will vary depending on the model you choose. As a general rule, higher-priced pants will provide more hip, kidney, and tailbone protection without adding too much bulk. You can still get a good quality pant at a lower price  point, but the fit, protection, or movement of the pant may be somewhat compromised.\n<br><br>\n\n\nTo find the best fit, compare your height, weight, age, and waist size with the charts provided. If you're looking at a \"Tall\" version of a pant, the waist size on the chart will be accurate, but the length will represent that of the next size bigger."
          }
        },
        "accordion_item_HEKhjx": {
          "type": "accordion_item",
          "settings": {
            "title": "The right fit for Player Elbow Pad",
            "content": "<b>Things to consider: <\/b><br>\n\nAge, Height and Weight<br>\nLevel of Play<br>\nLength of Area of Desired <br>Protection<br><br>\nWhen trying on or fitting elbow pads, there are a few important things to keep in mind to ensure a proper fit. <br><br>\n\n\n\nFirst, make sure that your elbow is placed in the center of the cup or designated area, and fasten the elbow pad using the straps provided. You will want to ensure that the elbow pad fits snugly and securely and will not slip off the elbow joint. Additionally, move your arms around with each pad on and pay attention to your range of motion, as this is crucial. You will notice differences in mobility with each product. If the elbow pad is too big, it will shift and slide around on your arm, which can be uncomfortable and even dangerous. On the other hand, if it is too small, your elbow will feel like it is sitting above the pad, which also will not provide proper protection.<br><br>\n\n\n\nWhen it comes to choosing elbow pads, there are various features to consider. Some models have a soft elbow cap, but most come with a hard plastic shell. Strapping systems can also differ, with some elbow pads having anchor straps or lock straps that provide a better lock to the pad than a regular elastic strap. These features are mainly determined by the brand and price range, and personal preference also plays a role in selecting the right elbow pads.\n<br><br>\nTo ensure a secure fit, adjust the semi-adjustable strapping until the pad feels comfortable on your arm. If the strapping feels too tight even after adjusting it, then you might need a bigger size. On the other hand, if you have fully tightened the strapping and the elbow pad is still loose or shifting on your arm, then a smaller size is likely to work better.\n\n\n<br><br>\nMost elbow pads come in Small, Medium, and Large sizes, and sizing charts are available online to help you determine the best fit. These charts are for reference purposes only, and personal preference should also be taken into account when selecting the size. To determine the proper sizing, wear your shoulder pad and gloves, and ask someone to measure the gap between them in inches."
          }
        },
        "accordion_item_a4kjkV": {
          "type": "accordion_item",
          "settings": {
            "title": "How to choose the right Hockey Stick",
            "content": "One-piece composite sticks are the top-selling category for many Source For Sports stores. The Pro-Formance Advantage Stick Fitting Protocol helps staff deliver a consistent method of fitting sticks from store to store across Canada. We take pride in fitting customers with the right product for their game to help them perform at a higher level and play safely.<br><br>\n\n\n\n<b>Things to consider:<\/b> <br>\n\nMaterials and Construction of a Stick<br>\nStick Options (Curves, Blade Depth, Blade Angle, Toe Shape, Stick Flex, Flex Points, Stick Lie and Grip)<br>\nStick Sizing (Cutting Sticks and the effects cutting has on Flex)<br><br>\n<b>Materials<\/b><br> \nOne-piece sticks used in hockey are constructed using different materials such as graphite, Kevlar, and fiberglass. In sticks that are priced lower, the composite mixture used is mostly fiberglass with a small amount of graphite. This makes the stick heavier but a little more durable. High-end sticks, on the other hand, have a greater percentage of graphite and Kevlar added to increase their durability. The amount of graphite makes the stick very light and improves its performance significantly. Manufacturers create blades differently depending on what they believe  players are looking for. <br><br>\n\n\n\n<b>Stick Construction<\/b><br>\n\nCompression molding is a process that involves placing multiple layers of thin composite material onto a steel mandrill mold and then compressing them to form the shape of a stick. This procedure results in a very consistent shape and feel of the stick.<br><br>\n\nBladder molding, on the other hand, involves molding the composite material over an inflated bladder while inside a mold. This method may have some inconsistencies in the shapes it creates.<br><br>\n\nTrue spear technology is a process that fuses layers of composite material of the blade onto the spear end of a shaft. This results in excellent energy transfer since no joint or weak spot is created.<br><br>\n\nShaft and blade fusion is a method that involves joining a shaft and blade, and then finishing off the stick with layers of composite material.<br><br>\n\n<b>Stick Options<\/b><br><br>\n\n<b>Curves <\/b>- Heel\/Mid\/Toe curves - Where the curve of the blade is most prominent <br><br>\nHeel: Puck travels along the entire blade when passing and shooting for better accuracy and harder wrist shots <br><br>\nMid: Most common curve, best of both worlds for puck control and shooting <br><br>\nToe: Flat blade face, curves sharply at the toe. Great for quick slapshots and toe drags, more difficult to control for shooting and passing accuracy<br><br>\n<b>Blade Depth<\/b> - How deep the curve is<br><br>\n<b>Blade Angle <\/b>- Closed face vs. open face <br><br>\n- Open face easier for loft on the puck (get the puck up quickly) <br>\n- Closed face is better for controlling and protecting the puck<br><br>\n<b>Toe Shape <\/b><br>\n- Square toe: More blade area <br>\n- Round toe: Better puck control\n\n<br><br>\n<b>Stick Flex<\/b> - Senior, Intermediate, Junior, Youth.<br> \n- Senior Flexes: 75, 85, 95, 100, 110 - Shaft Dimensions: 3cm x 2 cm<br> \n- Intermediate Flexes: 75, 70, 65, 60, 55 - Shaft Dimensions: 2.7cm x 1.7cm<br> \n- Junior Flexes: 40, 45, 50 - Shaft Dimensions: 2.7cm x 1.7cm <br>\n- Youth Flexes: 40, 30, 20 - Shaft Dimensions: 2.5cm x 1.5cm <br><br>\n<i>Players want to be able to fully flex the stick. If a stick is too soft, the resulting shot will be inaccurate and weak. If a stick is too stiff, there will be no power behind the shot.<\/i>\n<br><br>\n<b>Flex points<\/b> - Mid-flex sticks\/Low-flex sticks<br> \n- A mid-flex stick will have a stiffer taper so that it flexes more in the middle of the shaft. It has a longer loading time for a more powerful shot, perfect for slap shots.<br>\n- A low-flex stick will have a stiffer middle of the shaft and softer taper so that it flexes at the bottom of the shaft close to the blade It will have a much quicker release perfect for quick snap shots and writs shots.<br><br>\n<b>Stick Lie <\/b>- Lie describes the angle of the blade to the shaft <br>\n\n- A 5 lie is a 135-degree angle and each lie increase is an angle decrease of 2 degrees (the higher the lie the greater the angle).<br>\n- The player's body positioning impacts the lie in that the straighter up the player stands, the more toe of the blade will be on the ice. The deeper the player bends down the more the heel of the blade will be on the ice.<br>\n- If you start with the right line and add length to the stick it will put the blade more on the heel and if you cut the stick down it will put the blade more on the toe.<br>\n- A lower lie is more recommended for a player who skates bent over or uses a longer stick. A higher lie is recommended for a player who skates more upright and prefers a shorter stick. If you’re noticing too much wear on the heel or the toe of your stick then it might be a good idea to get a different lie. Go to a lower lie if you’re experiencing a lot of heel wear and go to a higher lie if that wear is appearing closer to the toe.<br>\n\n\nGrip - Traditional clear finish on a stick will allow for easy movement of the player's hand up and down the shaft of the stick. The grip option is a “sticky” feeling down the shaft that will give the player better control of the stick while shooting. When leaning into a slap shot, the grip option will not allow the stick to twist in the player's hand when the stick makes contact with the puck for a more accurate shot. Some manufacturers are offering what is called a raised tactile grip. This option is just raised ridges on the shaft that offer a little more control over the stick without limiting the player's hand movement along the shaft.<br><br>\n <b>Grip<\/b> -  on a stick is a personal preference option that each player will have a different opinion on. It’s important to give the customer all of the information you can so he or she can consider it all and make the correct decision.<br><br>\n\n\n<b>Cutting Sticks and Effects on Flex<\/b><br> \n\nCutting down a hockey stick affects its flexibility. The stiffness of a stick increases as soon as it is cut down from its full length. To educate customers about this effect, some manufacturers, such as Bauer, mark the back of the shaft with the flex rating if the stick were cut at that point. This information is important because it shows how cutting down a stick can affect its flex and performance. It is crucial to ensure that, even after cutting down the stick to the desired length, it can still flex correctly to achieve the desired performance. For instance, a 75 flex stick might feel perfect at full length in the shooting room, but it will quickly become stiffer if a significant portion of it is cut off. Check out this short video for more insights.\n<br><br>\n\n\nIf a stick does not have different flex markings down the back of the shaft, the general rule is that for every inch cut off, the stick's stiffness increases by 3%. The number after \"flex\" (100, 85, 50, etc.) indicates the force required to flex the stick one inch. For example, a 100-flex stick requires 100 lbs of force to flex it by one inch.<br><br>\n\n\n\n<b>Cutting Sticks<\/b> <br>\nAfter making sure the stick is paid for try to determine the correct length for the customer. There will be many who have found a comfortable height that they like their sticks to be but there will also be some who have no idea.<br><br>\n\nWhile the customer is standing on their flat feet mark the stick at the height of their nose or if they prefer standing on their tip toes mark the stick near their chin. Get the customer to hold the stick in that position to see how they like it and make sure they keep in mind that they will be wearing skates when using the stick. \n<br><br>\nOnce the length has been decided make sure to clamp the stick in straight for cutting. It helps to clamp the stick at the actual point where you want to cut it and use the clamp as a guide.<br><br>\n\n<b>Putting It All Together:<\/b><br>\n\nFitting a customer for a hockey stick is not an exact science. There are no specific measurements or sizing that can be used to find the perfect stick for every player. However, by asking the right questions and combining product knowledge, you can find the right stick for the player.<br><br>\n\nPrice is an important factor, and although you may not be able to convince a customer to spend significantly more than they intended, you can suggest spending a little extra for the benefits of a better quality stick. It's important to know the type of warranty that comes with the stick and how the company handles their warranties. Is the warranty consumer direct or in-store? How flexible is the company with their warranty policy? Knowing this information can help you make the right recommendation.<br><br>\n\nIt's important to understand that no stick can turn an inexperienced player into a superstar. The purpose of getting the correct fit of a stick is to maximize the potential of each individual player. For instance, if the player is a tall, strong, and pure shooter who doesn't worry too much about passing accuracy, then a stick that's a little stiffer, has a higher flex point, and an aggressive curve might be a good option. If the player is shorter, passes often, and prefers wrist shots, then perhaps a low kick point stick with a light flex and a straighter curve would be a better option. Ultimately, the final decision of what stick to choose should be made by the player.<br><br>"
          }
        },
        "accordion_item_nViKgg": {
          "type": "accordion_item",
          "settings": {
            "title": "How to tape your hockey stick",
            "content": "There are many ways to tape a hockey stick blade and handle, and pretty sure each player will soon have their style and preference on how to tape their stick.<br><br>\n\n\n\nNot all tapes are the same. It's best to use a tape that unwinds evenly from the roll and is sturdy enough to resist moisture and abrasion without being bulky. The tape serves to protect the blade of the stick from chip and puck marks and will give a better \"puck feel\" when receiving a pass or taking a shot.\n<br><br>\n\n\nThe most common type of hockey tape is made of cloth, and while there are some patterned tapes, as the skill level rises, the most commonly used will be black or white tape. White tape on the blade allows you to see the puck clearly while Black tape is often used by more experienced players to camouflage the puck, making it harder for the opposing team's players and goalie to see it. Goalies, on the other hand, always use white tape on the blade of their paddle because they need to see where the puck is!\n\n<br><br>\n\n\nTape on the shaft and handle of the stick provides a sure grip, especially for the upper hand, which controls the stick and helps your child handle the puck. You only need to tape down about 1 ½ glove lengths, leaving the lower hand able to slide on the shaft easily.<br><br>\n\n\n\nOn a quick note, White tape is less likely to leave marks on the palm of your glove than black tape. Otherwise, the color of the stick handle is a personal preference. \n\n \n\n<br><br>\n\n<h5>TAPING THE BLADE<\/h5><br>\nUsing either white or black tape, you will be starting from the heel of the blade and working your way to the toe. By going in this direction, the tape will lie flat on the bottom of the blade and be smooth on the ice.<br><br>\n\n\n\nHold the stick with the blade front up and facing you in your non-dominant hand. Using the other hand and starting at the backside of the blade, affix the end of the tape on the blade and bring the roll of tape over the top of the blade and down the front. Continue to circle over and around the blade, keeping the tension on the roll of tape as you go around, overlapping each layer of tape by about ¼” (0.6 cm).<br><br>\n\nContinue towards the toe of the blade until you have about 2 inches (5 cm) of blade left showing. The most important thing is to apply the tape as smoothly as possible all the way so that there will be no friction on the bottom, and no weird puck bounces off wrinkles.<br><br>\n\n\n\n<h5>TAPING THE HANDLE<\/h5><br>\nStart by going around the very end of the tape several times to create several layers of tape. This makes the knob that will help keep the stick end from slipping through your child’s glove. Players only need enough of a bump to provide a barrier, but goalies will need a much bigger knob on the end of their stick to reduce the chances of dropping it at the crucial moment.\n<br><br>\nIn the same manner as the blade, continue to spiral down the stick handle, carefully overlapping each layer by about ¼ inch. End the tape once you have reached an area that is approximately 1 and ½ glove’s length with a final, even revolution.\n\n<br><br>\n\nSome young players will have their stick taped with an extra “grip” ridge. This is achieved by pulling out a length of tape (3 ft \/ 91 cm), letting the roll create weight at the bottom, and twirling it to create a rope. This is then applied in a loose coil from the point in the shaft where you want it to end, and winding up to the top where you will begin to create the knob. You will then continue in the overlap fashion back down the shaft, covering the tape rope. This method will help you have more grip on the stick but will interfere with the ability to slide your hands.\n\n<br><br>\n\nYou will need to remove and reapply the tape when it shows wear, especially on the bottom of the blade. For a new player, this could be every few games. For an elite player, this could be during a game."
          }
        }
      },
      "block_order": [
        "accordion_item_YjEWMN",
        "accordion_item_TKrcCC",
        "accordion_item_wtK4ei",
        "accordion_item_mXhA8R",
        "accordion_item_AfiBXe",
        "accordion_item_9JU7XA",
        "accordion_item_GdXTq6",
        "accordion_item_yAN3DW",
        "accordion_item_Ux3LbL",
        "accordion_item_fbCrxf",
        "accordion_item_JE48zz",
        "accordion_item_HEKhjx",
        "accordion_item_a4kjkV",
        "accordion_item_nViKgg"
      ],
      "custom_css": [
        "h4 {text-align: center;}",
        "div {padding: 1rem 2rem;}"
      ],
      "settings": {
        "top_heading": "Product Info",
        "heading_tag": "h4",
        "heading_size": "h4",
        "accordion_icon": "1",
        "open_first": false,
        "section_fullwidth": false,
        "color_scheme": "",
        "padding_top": 85,
        "padding_bottom": 70,
        "padding_rate": 75
      }
    }
  },
  "order": [
    "heading",
    "accordion_inline_kQAXLA",
    "accordion_inline_ykVmyj",
    "accordion_inline_ijmy7e",
    "accordion_inline_QHXtfF",
    "accordion_inline_YtbiaV",
    "accordion_inline_zKGeqc",
    "accordion_inline_bqQ4Ha"
  ]
}
